public_html/articles/emacs/ecb.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emacs Code Browser - Emacs как IDE</title>
<!-- 2017-10-17 Вт 16:39 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="rigidus" />
</head>
<body>
<div id="content">
<h1 class="title">Emacs Code Browser - Emacs как IDE</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Инсталляция</a></li>
<li><a href="#sec-2">2. Конфигурирование</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Инсталляция</h2>
<div class="outline-text-2" id="text-1">
<p>
Добавляем в CEDET EmacsCodeBrowser, который превращает emacs в
многоязыковую IDE.
</p>

<p>
Берем снапшот из &lt;a href="<a href="http://ecb.sourceforge.net/cvs_snapshots/ecb.tar.gz">http://ecb.sourceforge.net/cvs_snapshots/ecb.tar.gz</a>"&gt;официального
репозитория&lt;/a&gt; и распаковываем в &lt;code&gt;~/.emacs.d/ecb&lt;/code&gt;
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Конфигурирование</h2>
<div class="outline-text-2" id="text-2">
<p>
Добавляем в конфиграционный файл Емакса следующие строчки:
&lt;source lang="lisp"&gt;
;; Load ECB
(add-to-list 'load-path "~/.emacs.d/ecb")
(require 'ecb-autoloads)
(global-set-key (kbd "C-x p") 'ecb-activate)
(global-set-key (kbd "C-x j") 'ecb-deactivate)
(global-set-key (kbd "C-x ,") 'ecb-toggle-ecb-windows)
(global-set-key (kbd "\e\eg") 'goto-line)
(global-set-key [?\M-g] 'goto-line)
(define-key global-map (kbd "C-&lt;tab&gt;") 'workspace-controller)
(setq ecb-tip-of-the-day nil)
(setq ecb-prescan-directories-for-emptyness nil)
&lt;/source&gt;
После этого перезапускаем Емакс и даем команду &lt;code&gt;M-x ecb-byte-compile&lt;/code&gt;,
которая ускорит загрузку нашей среды программирования.
</p>

<p>
Теперь, чтобы запустить ECB можно нажать &lt;code&gt;C-x p&lt;/code&gt; А чтобы скрыть &lt;code&gt;C-x&lt;/code&gt; ,
Ну а если вы хотите вообще выключить ECB - &lt;code&gt;C-x j&lt;/code&gt; При желании вы можете настроить свои
комбинации клавиш.
</p>

<p>
Продуктивной работы!
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: rigidus</p>
<p class="date">Created: 2017-10-17 Вт 16:39</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode )</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
